# coding:utf-8

from matplotlib import pyplot
import numpy as np

# data = np.loadtxt('/home/dushao/桌面/freature.data', dtype=float)
#
# pyplot.plot(data)
# pyplot.show()

data = np.array(
    # [0.6439,0.4771,2.0128,0.475,0.673,0.4605,0.6439,0.4564,0.6397,0.4792,0.6543,0.4647,0.6189,0.473,0.6335,0.4647,0.6543,0.4543,0.6273],
                [0.5834,0.8795,0.7084,0.4834,0.5314,0.623,0.5459,0.4626,0.6814,0.5397,0.4897,0.6876,0.4709,0.5188,0.6503,0.5272,0.4647,0.6835,0.4813,0.5355,0.6564,0.546,0.4522,0.6731,0.4835,0.5168,0.7668,0.4688,0.6168,0.6667,0.5418,0.448,0.673,0.4792,0.5252,0.6189,0.523,0.4563,0.6855,0.4668,0.5397,0.6772,0.4606,0.5188,0.6481,0.5209,0.4522,0.6876,0.4772,0.5418,0.6939,0.5147,0.4647,0.6835,0.6668,0.5105,0.6876,0.473,0.5168,0.7397,0.5647,0.8939,0.6897,0.4855,0.4814,0.646,0.4834,0.4563,0.6377,0.6232,0.4814,0.6294,0.4855,0.4605,0.7502,0.475,0.4563,0.648,0.4855,0.6753,0.6626,0.4605,0.4584,0.6314,0.5355,0.4647,0.7209,0.4751,0.5355,
                 0.6834,0.498,0.4626,0.6273,0.4668,0.5334,0.6168,0.4688,0.4709,0.6584,0.5293])
# pyplot.plot(data)
# pyplot.show()
'''
Numpy的核心就是ndarray对象
    ndarray和array
    使用python数据结构生成，直接使用函数生成，读取文件数据
    
    np.array() 传入的对象是个list生成的是一维，如果shape指定生成就是一个指定维度的矩阵
    常用变量及参数
    dtype
    shape 存放数组的大小，这个值是可变的。
    reshape 创建一个改变了形状的数组，与原数组是内存共享的，即都指向同一块内存
'''
data1 = np.array([[1., 2., 3], [2, 3, 4], [3, 4, 5]], dtype=np.int) # 生成3 × 3 矩阵
data2 = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=np.int)
print(data2.reshape((3, 3)).shape)
print(data1.shape)
pyplot.plot(data1)
pyplot.show()